AIDS
Africa
African-American
Agnes
Alaska
Allen
American
American English
American football
Amy
Andes
Angel Falls
Ann
Anne Frank
April
Arabian
Arctic
Argentina
Arsenal
Astro Boy
Atom
August
Australia
Ben
Bhutan
Bhutanese
Blue Demon
Braille
Brasilia
Brazil
British
Bulgarian
CD
Calcutta
California
Canada
China
Chinese
Christmas
December
Earth
Eastern Europe
Eiffel Tower
Elena
Emma
English
Europe
Eurostar
February
French
French fries
Friday
German
Germany
God
Gold Coast
Greece
Hawaii
Hawaiian
I
I'd
I'll
I'm
I've
Iguazu Falls
India
Indian
Internet
January
Japan
Japanese
Jenny
Jim
Joey
John
July
June
Juneau
Kate
Kent
Kessler
Kilimanjaro
Laura
Lisa
London
Los Angeles
Macedonia
Machu Picchu
Manon
March
Mary
May
Meg
Mike
Monday
Mr.
Ms.
Mt.
Nancy
Napaporn
National Gallery
Nazca Lines
New York City
Nobel Peace Prize
North Carolina
November
OK
October
Okinawa Prefectural Peace Memorial Museum
One Piece
P.E.
Pablo
Paris
Pat
Peru
Phan
Philippines
Red Demon
Renoir
Roman
Rome
Ryukyu Kingdom
Santiago
Sarah
Saturday
Seema
September
Sonia
South Africa
Spain
Star Wars
Stevie Wonder
Sunday
Sydney
T-shirt
TV
Tanzania
Teresa
Thai
Thailand
Thanksgiving
Thursday
Tokyo Skytree
Tuesday
U.K.
U.S.
United Nations
Venezuela
Vietnam
Wednesday
Western
White
Wilson
World Cup
World Heritage Site
Yorkshire Pudding
a
a.m.
able
aboard
about
above
abroad
accident
acid rain
across
actually
add
addition
address
advantage
adventure
afraid
after
afternoon
again
against
age
ago
agree
ahead
air
airport
album
all
allow
almost
alone
along
already
also
although
always
am
amaze
amazing
an
ancient
and
angry
animal
animation
anime
another
answer
anti-Jewish laws
any
anymore
anyone
anything
apartheid
apartment
apple
are
aren't
arena
arm
around
arrive
art
as
ask
assist
at
ate
attention
attract
aunt
away
baby
back
bad
bag
ball
balloon
bamboo
banana
band
bank
baseball
basketball
bath
be
beach
beautiful
became
because
become
bed
beef
been
before
began
begin
believe
below
bench
best
better
between
big
bike
bird
birthday
black
blind
blow
blue
blush
board
boat
book
bookstore
born
borrow
both
bottle
bought
box
boy
branch
brave
bread
break
breakfast
bridge
bring
brother
brought
brush
bubble
build
building
built
burn
bus
business
busy
but
butter
button
buy
buzzer
by
cafeteria
cake
calendar
call
came
camera
can
can't
cannot
cap
capital
car
card
care
career
carpenter
carrot
carry
case
castle
cat
catch
cause
cave
celebrate
cent
center
century
chair
chance
change
charity
cheer
cheerful
cheeseburger
chef
chess
chest
child
childhood
children
choose
circle
city
class
classmate
classroom
clean
clearly
clerk
climate
climb
clock
close
cloth
clothes
cloud
cloudy
club
coach
coal
coat
coffee
cola
cold
collect
color
come
comic
communicate
communication
company
compartment
complain
computer
conditioner
condominium
continue
convenience
cook
cooking
cool
corner
cotton
cough
could
couldn't
count
country
course
cousin
cover
cracker
crane
cross
cry
culture
curry
custom
customer
cut
cute
cycling
dad
daily
date
daughter
day
dear
decide
degree Celsius
delicious
demonstration
dentist
department store
design
designer
desk
despair
diary
dictionary
did
didn't
die
difference
different
differently
difficult
difficulty
dinner
disagree
disappear
discount
dish
do
doctor
does
doesn't
dog
dollar
don't
done
door
dot
down
drama
dream
dressed
drink
driver
driveway
drop
drugstore
drum
duck
during
dying
e-mail
each
early
easily
eastern
easy
eat
eaten
egg
eight
eighteen
eighteenth
eighth
eighty
either
elementary
elementary school
elevator
eleven
eleventh
empty
emu
end
energy
enjoy
entertainment
environment
equal
era
eraser
especially
even
evening
event
every
everybody
everyone
everything
example
excellent
excited
exciting
excuse
exhibition
expensive
experience
explain
express
expression
eye
eyesight
face
fall
family
famous
fan
far
farming
fashion
fast
father
favorite
feel
felt
festival
fever
few
field
fifteen
fifteenth
fifth
fifty
fight
fill
final
finally
find
fine
finger
finish
firework
first
fish
fit
fitting room
five
five-story pagoda
flew
flight
floor
flower
fluffy
fly
follow
food
foot
football
for
foreign
forest
forever
forget
fork
form
former
forty
forward
fossil fuel
found
four
fourteen
fourteenth
fourth
free
fresh
friend
friendly
from
front
fruit
fulfill
full
fun
funny
furniture
futon
future
game
garbage
garden
gave
geese
gentleman
gentlemen
gesture
get
gift
girl
give
glacier
glad
global warming
glow-worm
go
gold
gone
goodbye
goodness
goose
got
government
grade
granddaughter
grandfather
grandmother
grandson
grass
great
green
greenhouse gas
greet
greeting
grew
grin
ground
group
grow
guess
guide
guitar
had
half
hall
ham
hamburger
hand
handle
happiness
happy
hard
harvest
has
hasn't
have
haven't
hay fever
he
he'll
he's
head
headache
health
hear
heard
heater
heavy
held
hello
help
her
here
here's
hers
herself
hi
high
hill
him
his
history
hit
hmm
hobby
hold
hole
holiday
home
homework
hope
hospital
hot
hot dog
hot spring
hotel
hour
house
how
how's
human
humid
hundred
hungry
hurt
husband
ice
iced
idea
if
important
in
including
increase
industry
influence
insect
insult
interested
interesting
international
into
introduce
invite
is
island
isn't
it
it'll
it's
itchy
its
job
join
journalist
joy
juice
junior
just
kangaroo
karaoke
keep
kept
kid
kill
kilometer
kind
king
know
known
koala
lab group
lady
lake
land
landing card
language
large
last
late
later
latest
laugh
law
lead
leader
learn
leave
left
leg
lend
less
let's
letter
level
library
lie
life
light
like
line
lion
listen
little
live
lives
living
locker
long
look
lose
lost
lot
loud
love
low
luck
lucky
lunch
lying
machine
made
magazine
make
man
many
marsh
match
math
matter
may
me
meal
mean
meaning
meat
medal
medicine
meet
meeting
melt
memory
men
message
met
meter
milk
mine
minus
minute
mirror
miss
missing
mom
month
moon
more
morning
most
mother
mountain
mouth
move
movie
much
museum
music
must
mustn't
my
mysterious
mystery
name
national
national holiday
national park
native
natural gas
near
necessary
need
neither
nest
never
new
news
newspaper
next
nice
night
nine
nineteen
nineteenth
ninety
ninth
nod
non-native
non-white
noodle
noon
nor
north
nose
not
notebook
nothing
notice
now
number
nun
nurse
nursery
o'clock
ocean
octopus
of
off
office
official
often
oh
oil
old
on
once
one
only
open
opinion
opposite
or
orange
orchestra
ordinary
origin
original
originally
other
our
ours
ourselves
out
over
overseas
own
p.m.
package
pain
painter
painting
pair
palm
pamphlet
panel
paper
paralyzed
paratha
pardon
parent
park
part
party
pass
passport
past
pastry shop
peace
pen
pencil
people
percent
perfect
perfectly
person
pharmacist
phone
photo
phrase
piano
picture
pie
piece
pizza
place
plane
plant
plastic
plate
play
player
please
plus
poem
point
police
pollution
polo
poodle
poor
popular
post
postcard
pot
pouch
pound
power
powerful
practice
present
pretty
prince
problem
produce
product
program
purpose
push
put
question
quickly
quiet
quite
rabbit
race
racket
radio
rain
rainbow
rainy
raise
ran
rang
read
reading
ready
really
receive
recycle
red
reduce
regular
release
remember
remove
report
reporter
research
resource
respect
responsible
rest
restaurant
return
reuse
rhythm
rice
rich
ride
right
ring
river
roast
robot
rock
rode
room
round
rule
run
runny
sad
said
salad
same
sanctuary
sandwich
sang
savanna
save
saw
say
scare
scenery
school
science
scientist
sculpture
sea
season
seat
second
section
see
seed
seen
sell
send
senior
sense
sent
separate
serious
serve
seven
seventeen
seventeenth
seventh
seventy
shake
shall
share
she
she'll
she's
shelf
ship
shirt
shock
shoe
shop
shopping
short
should
shouldn't
shout
show
shrine
shut
sick
side
sigh
sightseeing
sign
similar
simple
since
sincerely
sing
singer
sister
sit
site
situation
six
sixteen
sixteenth
sixth
sixty
size
skill
skillful
sky
sleep
sleepy
slowly
small
smart
smell
smile
smog
snack
sneaker
snow
snowy
so
soccer
sock
sofa
soft
softball
solar
solve
some
someone
something
sometimes
somewhere
son
song
soon
sore
sorry
sort
sound
soup
south
southern
speak
speaker
special
speech
spell
spend
spoke
spoken
spoon
sport
spread
spring
stable master
stadium
stair
stand
star
start
starvation
station
stay
stew
still
stomach
stomach ache
stop
store
story
straight
street
stringed instrument
strong
student
study
subject
suburb
subway
such
suddenly
summer
sumo stable
sumo wrestler
sun
sunlight
sunny
supermarket
support
sure
surprised
surround
swallow
sweet
swim
swimming
sword
symbol
system
table
take
taken
talk
tall
taught
taxi
tea
teach
teacher
team
teammate
telescope
tell
temperature
temple
ten
tennis
tenth
than
thank
that
that's
the
theater
their
theirs
them
then
there
there're
there's
these
they
they'll
they're
they've
thing
think
third
thirsty
thirteen
thirteenth
thirtieth
thirty
thirty-first
this
those
thought
thousand
three
throat
through
throw
ticket
time
timing
tired
to
toast
today
together
told
tomorrow
tongue
tonight
too
took
tool
toothache
toothbrush
top
touch
tough
tournament
toward
tower
track
traditional
traffic
train
translate
transportation
trap
travel
treasure
tree
trip
trouble
true
trust
try
tube
tuna
turkey
turn
turning
twelfth
twelve
twentieth
twenty
twenty-eighth
twenty-fifth
twenty-first
twenty-fourth
twenty-ninth
twenty-second
twenty-seventh
twenty-sixth
twenty-third
twice
two
uh
uh-huh
ukulele
uncle
unclean
under
underground
understand
unicycle
uniform
unique
university
unplug
until
up
upon
us
use
used
useful
usually
vacation
vegetable
vending machine
very
video
view
village
visit
visitor
voice
volume
wait
waitress
walk
wall
want
war
warm
warrior
was
wash
wasn't
waste
watch
water
waterfall
way
we
we'll
we're
we've
wear
weather
website
week
weekend
welcome
well
went
were
weren't
whale
what
what's
when
when's
where
where's
which
while
whisper
white
who
who's
whole
whose
why
wide
wife
wildlife
will
win
wind
window
windy
winter
wish
with
without
woman
women
won
won't
wonderful
wood
wooden
word
work
world
worry
would
wow
wrap
write
writing
written
wrong
wrote
year
yellow
yes
yesterday
yet
yogurt
you
you're
you've
youll
young
your
yours
yourself
zero
zoo
