a
able
aboard
about
above
abroad
accident
acid rain
across
actually
add
addition
address
advantage
adventure
afraid
Africa
African-American
after
afternoon
again
against
age
Agnes
ago
agree
ahead
AIDS
air
airport
Alaska
album
all
Allen
allow
almost
alone
along
already
also
although
always
am
a.m.
amaze
amazing
American
American English
American football
Amy
an
ancient
and
Andes
Angel Falls
angry
animal
animation
anime
Ann
Anne Frank
another
answer
anti-Jewish laws
any
anymore
anyone
anything
apartheid
apartment
apple
April
Arabian
Arctic
are
arena
aren't
Argentina
arm
around
arrive
Arsenal
art
as
ask
assist
Astro Boy
at
ate
Atom
attention
attract
August
aunt
Australia
away
baby
back
bad
bag
ball
balloon
bamboo
banana
band
bank
baseball
basketball
bath
be
beach
beautiful
became
because
become
bed
beef
been
before
began
begin
believe
below
Ben
bench
best
better
between
Bhutan
Bhutanese
big
bike
bird
birthday
black
blind
blow
blue
Blue Demon
blush
board
boat
book
bookstore
born
borrow
both
bottle
bought
box
boy
Braille
branch
Brasilia
brave
Brazil
bread
break
breakfast
bridge
bring
British
brother
brought
brush
bubble
build
building
built
Bulgarian
burn
bus
business
busy
but
butter
button
buy
buzzer
by
cafeteria
cake
Calcutta
calendar
California
call
came
camera
can
Canada
cannot
can't
cap
capital
car
card
care
career
carpenter
carrot
carry
case
castle
cat
catch
cause
cave
CD
celebrate
cent
center
century
chair
chance
change
charity
cheer
cheerful
cheeseburger
chef
chess
chest
child
childhood
children
China
Chinese
choose
Christmas
circle
city
class
classmate
classroom
clean
clearly
clerk
climate
climb
clock
close
cloth
clothes
cloud
cloudy
club
coach
coal
coat
coffee
cola
cold
collect
color
come
comic
communicate
communication
company
compartment
complain
computer
conditioner
condominium
continue
convenience
cook
cooking
cool
corner
cotton
cough
could
couldn't
count
country
course
cousin
cover
cracker
crane
cross
cry
culture
curry
custom
customer
cut
cute
cycling
dad
daily
date
daughter
day
dear
December
decide
degree Celsius
delicious
demonstration
dentist
department store
design
designer
desk
despair
diary
dictionary
did
didn't
die
difference
different
differently
difficult
difficulty
dinner
disagree
disappear
discount
dish
do
doctor
does
doesn't
dog
dollar
done
don't
door
dot
down
drama
drink
dream
dressed
driver
driveway
drop
drugstore
drum
duck
during
dying
each
early
Earth
easily
eastern
Eastern Europe
easy
eat
eaten
egg
Eiffel Tower
eight
eighteen
eighteenth
eighth
eighty
either
elementary
elementary school
Elena
elevator
eleven
eleventh
e-mail
Emma
empty
emu
end
energy
English
enjoy
entertainment
environment
equal
era
eraser
especially
Europe
Eurostar
even
evening
event
every
everybody
everyone
everything
example
excellent
excited
exciting
excuse
exhibition
expensive
experience
explain
express
expression
eye
eyesight
face
fall
family
famous
fan
far
farming
fashion
fast
father
favorite
February
feel
felt
festival
fever
few
field
fifteen
fifteenth
fifth
fifty
fight
fill
final
finally
find
fine
finish
finger
firework
first
fish
fit
five
fitting room
five-story pagoda
flew
flight
floor
flower
fly
fluffy
follow
food
foot
football
for
foreign
forest
forever
forget
fork
form
former
forty
forward
fossil fuel
found
four
fourteen
fourteenth
fourth
free
French
French fries
fresh
Friday
friend
friendly
from
front
fruit
fulfill
full
fun
funny
furniture
futon
future
game
garbage
garden
gave
geese
gentleman
gentlemen
German
Germany
gesture
get
gift
girl
give
glacier
glad
global warming
glow-worm
go
God
gold
Gold Coast
gone
goodbye
goodness
goose
got
government
grade
granddaughter
grandfather
grandmother
grandson
grass
great
Greece
green
greenhouse gas
greet
greeting
grew
grin
ground
group
grow
guess
guide
guitar
had
half
hall
hamburger
happy
has
have
Hawaii
Hawaiian
he
hello
help
her
here
hers
he's
hi
high
him
his
hmm
hobby
hold
home
homework
hot
hot dog
hour
house
how
how's
hundred
hungry
husband
I
iced
idea
I'm
in
India
insect
interested
interesting
Internet
is
isn't
it
it's
January
Japan
Japanese
Jenny
Joey
John
joy
juice
July
June
junior
kangaroo
Kate
keep
kilometer
kind
king
know
koala
lab group
large
last
laugh
Laura
left
let's
letter
library
light
like
lion
Lisa
listen
live
locker
London
long
look
Los Angeles
lot
love
low
lunch
machine
make
many
March
match
math
matter
May
me
mean
meaning
meet
Meg
Mike
milk
mine
minus
Monday
month
moon
more
morning
mother
movie
Mr.
Ms.
Mt.
much
music
my
name
Nancy
national park
near
new
New York City
next
nice
night
nine
nineteen
nineteenth
ninety
ninth
noon
not
notebook
nothing
November
now
number
o'clock
October
octopus
of
often
oh
OK
old
on
one
open
or
orange
other
our
ours
over
own
painting
pardon
park
peace
pen
pencil
people
phone
photo
piano
picture
pie
pizza
play
player
please
plus
poodle
pouch
practice
present
pretty
program
rabbit
racket
read
reading
really
receive
regular
rice
right
rock
room
run
sad
same
sanctuary
sandwich
Santiago
Sarah
Saturday
saw
say
school
science
season
second
see
Seema
send
September
seven
seventeen
seventeenth
seventh
seventy
she
she's
shopping
short
show
sigh
sign
sincerely
sing
sister
sit
six
sixteen
sixteenth
sixth
sixty
sky
sleep
sleepy
small
smart
smile
snack
so
soccer
some
sometimes
soon
sorry
sound
speak
special
sport
spring
stair
stand
star
start
story
straight
student
study
summer
Sunday
sure
surprised
sweet
swim
swimming
Sydney
system
take
talk
tall
tea
teach
teacher
team
telescope
tell
temple
ten
tennis
tenth
thank
Thanksgiving
that
that's
the
their
theirs
them
then
there
these
they
they're
thing
think
third
thirsty
thirteen
thirteenth
thirtieth
thirty
thirty-first
this
those
three
through
Thursday
time
tired
to
toast
today
together
tomorrow
tonight
too
traditional
train
try
T-shirt
Tuesday
tuna
turkey
turn
TV
twelfth
twelve
twentieth
twenty
twenty-eighth
twenty-fifth
twenty-first
twenty-fourth
twenty-ninth
twenty-second
twenty-seventh
twenty-sixth
twenty-third
two
uh-huh
ukulele
uncle
understand
unique
university
up
us
U.S.
use
vacation
vending machine
very
video
view
visit
wait
walk
want
wash
watch
water
way
we
website
Wednesday
week
welcome
well
went
we're
what
what's
when
when's
where
where's
which
while
White
who
who's
whose
wide
wildlife
Wilson
win
window
winter
with
woman
won
wonderful
word
work
wow
write
writing
year
yes
yesterday
you
young
your
you're
yours
zero
zoo
hand
handle
hard
hay fever
head
headache
hear
heavy
he'll
history
hit
hole
hope
hospital
hot spring
hotel
humid
hurt
ice
if
Iguazu Falls
I'll
important
Indian
influence
insult
international
invite
itchy
it'll
its
Jim
job
join
just
Kent
Kessler
kid
Kilimanjaro
lady
landing card
language
late
later
latest
learn
lead
leave
leg
lend
less
level
life
little
lives
lost
loud
luck
lucky
Macedonia
Machu Picchu
made
magazine
man
Manon
Mary
may
meal
meat
medal
medicine
meeting
message
meter
minute
mirror
missing
mom
most
mountain
move
museum
must
mustn't
mysterious
mystery
Napaporn
National Gallery
native
Nazca Lines
need
neither
never
news
Nobel Peace Prize
nod
non-native
nose
nun
nurse
nursery
ocean
off
office
official
once
One Piece
only
opposite
original
originally
out
overseas
Pablo
package
pain
painter
palm
pamphlet
paper
parent
Paris
part
party
pass
passport
pastry shop
Pat
percent
person
Peru
Phan
pharmacist
Philippines
piece
place
plane
plastic
point
police
polo
poor
popular
post
postcard
pot
pound
powerful
product
purpose
push
put
question
rain
rainy
raise
ran
recycle
Red Demon
reduce
remember
Renoir
resource
rest
restaurant
return
reuse
rich
ride
river
roast
rode
round
runny
said
savanna
save
scare
sculpture
sea
seat
section
sell
sense
sent
serve
shake
shall
she'll
shelf
shirt
shoe
shop
should
shout
sick
side
sightseeing
similar
simple
singer
site
size
snow
snowy
soft
solve
something
son
sore
sort
soup
speaker
spoke
spread
stable master
stadium
Star Wars
starvation
station
stay
stew
still
stomach
stomach ache
stop
store
street
strong
subject
subway
such
suddenly
sumo stable
sumo wrestler
sunny
supermarket
sword
table
Tanzania
taught
taxi
temperature
Teresa
Thai
than
Thailand
theater
there're
there's
they'll
thought
thousand
throat
ticket
Tokyo Skytree
told
tongue
took
tool
toothache
toothbrush
top
tough
tournament
tower
traffic
travel
treasure
trip
true
tube
U.K.
uh
under
underground
until
upon
used
usually
vegetable
Venezuela
Vietnam
village
visitor
voice
volume
waitress
wall
warm
warrior
was
wasn't
waterfall
weather
weekend
we'll
were
weren't
Western
whisper
why
wife
will
windy
without
women
won't
world
World Cup
World Heritage Site
worry
would
wrong
wrote
yet
Yorkshire Pudding
youll
yourself
ham
happiness
harvest
hasn't
haven't
health
heard
heater
held
here's
herself
hill
holiday
human
I'd
including
increase
industry
into
introduce
island
I've
journalist
Juneau
karaoke
kept
kill
known
lake
land
law
leader
lie
line
living
lose
lying
marsh
melt
memory
men
met
miss
mouth
national
national holiday
natural gas
necessary
nest
newspaper
non-white
noodle
nor
north
North Carolina
notice
oil
Okinawa Prefectural Peace Memorial Museum
opinion
orchestra
ordinary
origin
ourselves
pair
panel
paralyzed
paratha
past
P.E.
perfect
perfectly
phrase
plant
plate
p.m.
poem
pollution
power
prince
problem
produce
quickly
quiet
quite
race
radio
rainbow
rang
ready
red
release
remove
report
reporter
research
respect
responsible
rhythm
ring
robot
Roman
Rome
rule
Ryukyu Kingdom
salad
sang
scenery
scientist
seed
seen
senior
separate
serious
share
ship
shock
shouldn't
shrine
shut
since
situation
skill
skillful
slowly
smell
smog
sneaker
sock
sofa
softball
solar
someone
somewhere
song
Sonia
south
South Africa
southern
Spain
speech
spell
spend
spoken
spoon
Stevie Wonder
stringed instrument
suburb
sun
sunlight
support
surround
swallow
symbol
taken
teammate
they've
throw
timing
touch
toward
track
translate
transportation
trap
tree
trouble
trust
turning
twice
unclean
unicycle
uniform
United Nations
unplug
useful
war
waste
wear
we've
whale
white
whole
wind
wish
wood
wooden
wrap
written
yellow
yogurt
you've
