１つの, １人の, １枚の, １匹の 
〜する能力がある
〜に乗って
〜について
〜の上に
外国で
事故
酸性雨
向こう側に
実は
加える
加えること
住所
有利な立場
冒険
心配して
アフリカ
アフリカ系アメリカ人の
〜の後に
午後
再び
〜に対して
年齢
アグネス
〜前に
賛成する
〜の前方に
エイズ
空気
空港
アラスカ
アルバム
すべてのもの
アレン
許可する
ほとんど
ひとりで
〜に沿って
もう
〜もまた
〜だけれど
いつも
〜です
午前〜時
驚嘆させる
びっくりさせるような
アメリカ人
アメリカ英語
アメリカンフットボール
エイミー

古代の
と
アンデス山脈
エンジェルの滝
怒って
動物
映画
アニメ
アン
アンね・フランク
別のもの
答え
反ユダヤ人法

もはや
だれか
何か
アパルトヘイト
アパート
リンゴ
４月
アラビア人
南極海
〜です
競技場

アルゼンチン
腕
〜の周りを
着く
アーセナル
芸術
〜として
尋ねる
助ける
鉄腕アトム
〜の点で

アトム
注意
引きつける
８月
おば
オーストラリア
離れて
赤ちゃん
もとへ、帰って
悪い、ひどい
袋、かばん
ボール、球、玉
風船
竹
バナナ
バンド
銀行
野球
バスケットボール
風呂
〜です、〜である、いる、ある
砂浜、浜辺
美しい
becomeの過去形
〜なので
（〜に）なる
ベッド
牛肉
beの過去形
〜の前に
beginの過去形
（〜を）始める
（〜を）信じる
下の・に・を
ベン（男性の名前）
ベンチ、長いす
最上
good, wellの比較級
（２つのものの）間に・で
ブータン（南アジアの国の名前）
ブータン人（の）、ブータンの
大きい、大きいな
自転車
鳥
誕生日
黒（い・の）
目の不自由な
吐く
青（い・の）
青鬼
顔を赤らめる
板、黒板
船
本
書店
(bearの過去分詞形）
（〜を）借りる
両方とも
瓶、ボトル
(buyの過去形）
箱
男の子、少年
点字
支社、枝
ブラジリア（南米の国の名前）
勇敢な
ブラジル（南米の国の名前）
パン
休憩
朝食
橋
（〜を）持ってくる
イギリスの、イギリス人（の）
弟、兄
(bringの過去形・過去分詞形）
筆
泡、あぶく
（〜を）建てる、組み立てる、つくる
建物
(buildの過去形・過去分詞形）
ブルガリアの、ブルガリア人（の）
（〜を）燃やす
バス
商業
いそがしい
しかし、でも
バター
ボタン
（〜を）買う
ブザー
〜で、〜によって
カフェテリア
ケーキ
カルカッタ
カレンダー
カリフォルニア
（〜に）電話をする
(comeの過去形)
カメラ
（〜することが）できる
カナダ
〜できない
(cannotの短縮形)
帽子
大文字の
自動車
カード
注意
経歴
大工
ニンジン
（〜を）運ぶ
場合
城
猫
（〜を）つかまえる
（〜を）引き起こす
洞窟、ほら穴、横穴
コンパクトデイスク
（〜を）祝う
セント
中心、中央、真ん中
世紀
いす
機会
変わる
慈善団体
（〜を）元気付ける
明るい、決活、陽気な
チーズバーガー
コック長
チェス
胸
子供
幼少時代
(childの複数形)
中国（アジアの国の名前）
中国語、中国の、中国人（の）
（〜を）選ぶ
クリスマス
円
市、都市
クラス、組、学級
同級生, クラスメート
教室
掃除する、きれいな、汚れていない
はっきりと
店員
気候
登る
時計
近い
布
衣服
雲
曇りの
クラブ、部
コーチ
石炭
コート、上着
コーヒー
コーラ
冷たい、寒い、風邪
（〜を）集める
色
来る
マンガ
伝える、伝え合う
伝えること
会社
もの入れ
不平を言う
コンピュータ
冷暖房機
分譲マンション
続ける、続く
便利（なもの）
（〜を）料理する
料理
かっこいい、涼しい
角
綿
せき
〜してくださいますか。
(could notの短縮形)
（〜を）数える
国
方向、進路
いとこ
（〜を）覆う
クラッカー
鶴
（〜を）渡る
叫ぶ、泣く
文化
カレー
慣習、しきたり
客
（〜を）切る
かわいい
サイクリング
お父さん
非常の、毎日の
日付
娘
日
親愛なる
１２月
（〜しようと）決める

とてもおいしい
デモ、デモンストレーション
歯科医
デパート
（〜を）デザインする、設計する
デザイナー
机
絶望する
日記、日記帳
辞書、辞典
(doの過去形)
(did notの過去形)
死ぬ
違い、相違
異なった
（〜と）異なって
難しい、困難な
苦難、困難
夕食
意見が合わない、賛成しない
消滅する
割引
料理、皿
する
医者

(doesの短縮形)
犬
ドル
(doの過去分詞形)
(do notの短縮形)
ドア、戸
点
下に、下の方へ
ドラマ、劇
飲みもの
夢
服を着た
運転手
車道
一滴
薬局
ドラム
カモ、アヒル
〜の間（ずっと）、〜中
死にかけている
それぞれの
早く
地球
簡単に
東の、東部の、東方の
東ヨーロッパ
やさしい、簡単な
食べる
(eatの過去分詞形）
卵
エッフェル塔
８、８つ（の）
１８（の）
１８番目（の）、１８日
８番目（の）、８日
８０（の）
（〜not..., eitherで）〜も...しない
初歩の、初等の
小学校
エレナ（女性の名前）
エレベーター
１１（の）
１１番目（の）、１１日
電子メール、Eメール
エマ（女性の名前）
空の
エミュー
終わり
エネルギー
英語
（〜を）楽しむ
娯楽
環境
平等な
時代
消しゴム
特に、特別に
ヨーロッパ
ユーロスター
〜さえも
夕方、晩、夜
行事、イベント
毎〜、すべての〜、〜ごとに、どの〜もみな
だれでも、みんな
みんなさん、みんあ、だれでも
すべてのこと/もの、何もかも
例
非常に優れた、優秀
興奮
わくわくするような、興奮させる
許す
展覧会
高価な
経験、体験
説明する
急行
表現、言い回し、表情
目
視力
顔
秋
家族
有名な
（芸能・スポーツなどの）ファン
遠く
農業
流行、ファッション、流行の服装
速く
父親、お父さん
お気に入りの
２月
（〜を）感じる
(feelの過去・過去分詞形)
祭り
（病気の）熱
(aを付けて)少数の、２・３の
草原
１５（の）
１５番目（の）
５番目（の）、５日
５０（の）
戦う
（〜を）満たす、いっぱいにする
最後の
最後には、とうとう
（〜を）みつかる
元気な
（〜を）終える、終わる
指
花火
１番目（の）、１日、最初の
魚
（サイズ・形が）合う
５，５つ（の）
誠着室
五重塔
(flyの過去形)
（飛行機ノ）便、飛行
階
花
飛ぶ、（〜を）飛ばす
ふわふわした、柔らかい
（〜の）後についていく、（〜に）従う
食べもの
(theを付けて）(ものの)下の方、（山の）ふもと

（目的を示して）〜のために/の
外国の
森林、山林
永久に、いつまでも
（〜を）忘れる
フォーク
（〜を）形作る
以前の、前の、昔の
４０（の）
前に/へ
化石燃料
(findの過去・過去分詞形)
４，４つ（の）
１４（の）
１４番目（の）、１４日
４番目（の）、４日
自由な、ひまな
フランス人（の）、フランス語（の）
フライドポテト
新鮮な、新しい
金曜日
友達
親しみやすい、気さくな
（出所を示して）〜出身（の）、〜から（の）
（建物の）正面、表、前面
果物
実現すろ
いっぱいの、満腹で
おもしろいこと、楽しいこと
おもしろい、愉快な
家具
フトン、ソファーベッド
未来、将来
試合、ゲーム
生ごみ、くず
庭
(giveの過去形)
(gooseの複数形)
紳士
(gentlemanの複数形)
ドイツ人
ドイツ
身振り
（ある状態に）なる
贈りもの
女の子、子女
（〜を）与える
氷河
うれしい
地球温暖化
ツチボラる
行く
神
金（の）
ゴールドコースト
(goの過去分詞形)
さようなら
親切、善良さ
ガン（動物名）
(getの過去・過去分詞形)
政府
学年、等級
孫娘、女の孫
おじいさん、祖父
おばあさん、祖母
孫息子、男の孫
草、牧草
すばらしい、偉大な
ギリシア
緑（の）
温室効果ガス
（〜に）挨拶する、（〜を）むかえる
挨拶
(growの過去形)
にこっと笑う、にやっと笑う
地面
グループ、班
育つ、成長する
推測する、言い当てる
（旅行などの）案内人、ガイド
ギター
(haveの過去・過去分詞形)
（試合の）前半または後半、半分
事務所、集会所
ハンバーガー、ハンバーグ（ステーキ）
うれしい、幸せな
(haveと同じ意味)
（〜を）持っている、飼っている、（〜が）ある・いる
ハワイ州
ハワイの、ハワイ人の、ハワイ語の
彼は・が
やあ、こんにちは
（〜を）手伝う
彼女に・を
ここ
彼女のもの
(he isの短縮形)
やあ
高い、高いところにある
彼を・に
彼の
（よく考えている様子を表して）うむ、ふうむ
趣味、道楽
（〜を）持つ
家に・で
宿題
熱い
ホットドッグ
時間
家
どのように（して）、どれくらい
(how isの短縮形)
100 （の）
おなかがすいた
夫
私
冷やした
考え、アイデイア
(I amの短縮形)
(inは何かの内部・内側を示す),
インド（南アジアの国の名前）
虫、昆虫
興味を持った
興味深い
インターネット
〜です、〜である、〜にいる
(is notの短縮形)
それは・が
(it isの短縮形)
１月
日本
国語、日本語、日本人、日本の、日本語の、日本人の
ジェニー（女性の名前）
ジョーイ（男性の名前）
ジョン（男性の名前）
喜び
ジュース
７月
６月
年下の、年少の
カンガルー
ケイト（女性の名前）
（〜を）しまっておく、保管する
キロメートル
親切な,　種類
王、国王
（〜を）知っている
コアラ
実験班
大きい、多い
この前の
笑う
ローラ（女性の名前）
左に
(let usの短縮形)
字、文字
図書館
明かり、軽い
（〜を）好む、（〜が）お気に入っている、（〜が）好きである
ライオン
リサ（女性の名前）
聞く、耳を傾ける
住む、住んでいる、暮らす
ロッカー
ロンドン（イギリスの首都）
長い
見る
ロサンゼルス
たくさん
（〜が）大好きである、（〜を）愛する
低い
昼食
機械
（〜を）作る
たくさんの
３月
試合
数学、単数
困ったこと、心配
５月
私に・を
（〜を）意味する
意味
（〜に）会う、出会う
メグ（女性の名前）
マイク（男性の名前）
牛乳、ミルク
私のもの
〜を引いて
月曜日
月
月
これ以上の、もっと
朝、午前
母親、お母さん
映画館
〜さん、〜先生（男性に使う）
〜さん、〜先生（女性に使う）
（〜）山
たくさん、とても
音楽
私の
名、名前
ナンシー（女性の名前）
国立公園
〜の近くに、〜のそばに
新しい
ニューヨーク市
次（の人）
すてきな
夜、晩
９，９つ（の）
１９（の）
１９番目、１９日
９０（の）
９番目（の）、９日
正午
〜（で）ない
ノート
何も〜ない
１１月
今
数
（ちょうど）〜時
１０月
タコ（生物）
〜の
しょっちゅう、よく
おおっ、おや、まあ
元気な、だいじょうぶな、よろしい
〜歳である
〜で、〜によって
１，１人、１つ（の）
（〜を）開く
か、または、それとも
オレンジ（果物）
ほかの〜、別の〜
私たちの
私たちのもの
上方へ・を、こえて、向こうへ
自分自身の
絵を描くこと
許すこと、許し
公園
平和
ペン
鉛筆
人々
電話
写真
ピアノ
写真、絵
パイ
ピザ
（スポーツを）する、遊ぶ
（スポーツを）する人、選手、（楽器を）演奏家
どうぞ、お願いします
〜を加えて
プードル（犬の１品種）
袋
（〜を）練習する
贈りもの
かなり
番組
ウサギ
ラケット
（〜を）読む
読むこと
本当に
（〜を）受け取る
正規の、レギュラーの
米（の）、ごはん
正しい、その通り
ロック
部屋
走る
悲しい
〜と同じ
保護区
サンドイッチ
サンチアゴ
サラ（女性の名前）
土曜日
(seeの過去形)
（〜と）言う
学校
（教科）理科、科学
季節
２番目（の）、２日
（人に）会う
シーマ（女性の名前）
（〜を）送る
９月
７，７つ（の）
１７（の）
１７番目（の）
７番目（の）、７日
７０（の）
彼女は・が
(she isの短縮形)
買い物
短い、小さい
（〜を）示す、（〜を）見せる
ため息をつく
符号、記号、しるし
敬具
歌う
妹、姉
座る、座っている
６、６つ（の）
１６（の）
１６番目（の）、１６日
６番目（の）、６日
６０（の）
空
眠る
眠い、眠そうな
（大きさが）小さい、狭い
利口な、かしこい
笑顔、ほほえみ
おやつ、軽食
(notの後で)それほど〜ない
サッカー
いくらかの、多小の
ときどき
すぐに、じきに
すまなく思って残念に思って
〜に聞こえる、思われる
（〜を）話す
特別な
スポーツ
春
階段
立つ、立っている
星
始まる、（〜を）始める
話、ストーリー
まっすぐに
生徒
（〜を）勉強する
夏
日曜日
いいとも、もちろん
びっくりした、おどろいた
甘い食べもの、お菓子
泳ぐ
水泳、泳ぐこと
シドニー（オーストラリアの都市名前）
方式、方法、制度
（〜を）する、行う
話す
背が高い、高い
お茶、紅茶
教える
教える人、教師
チーム、部
望遠鏡
（〜を）話す、教える、伝える
寺、寺院
１０（の）
テニス
１０番目（の）、１０日
（〜に）感謝する
感謝祭
あれ、それ、あの人・もの・こと
(that isの短縮形)
その、あの、例の
彼（女）らの、それらの
彼（女）らのもの、それらのもの
彼（女）らに・を、それらに・を
それから・その次に
そこに・で
これらの
彼（女）らは・が、それらは・が
(they areの短縮形)
こと、もの
教える、思いをめぐらす
３番目（の）、３日
のどが渇いた
１３（の）
１３番目（の）、１３日
３０番目（の）、３０日
３０（の）
３１番目（の）、３１日
こちらは、これ、この人・もの・こと
あれらの、それらの
３、３つ（の）
〜を通して、〜によって
木曜日
時刻
疲れた
〜に対して、〜にとって
トースト
今日は
一緒に
明日（は）
今夜（は）
も、（〜も）また
伝統的な
電車
（〜を）試す、やってみる
Tシャツ
火曜日
まぐろ
七面鳥
曲がる
テレビ
１２番目（の）、１２日
１２（の）
２０番目（の）、２０日
２０（の）
２８番目（の）、２８日
２５番目（の）、２５日
２１番目（の）、２１日
２４番目（の）、２４日
２９番目（の）、２９日
２２番目（の）、２２日
２７番目（の）、２７日
２６番目（の）、２７日
２３番め（の）、２３日
２，２つ（の）
うんうん、ふーん
ウクレレ
おじ
（〜を）理解する、（〜が）わかる
めずらしい、独特の
大学
上に、上がって
私たちを・に
アメリカ
使用、使い道
休み、休暇
自動販売機
とても
ビデオ
ながめ、景色、風景
（〜を）訪ねる
待つ
歩く
（〜を）欲しいと思う
（〜を）洗う
（〜を）見る
水
道
私たちは・が
ウエブサイト
水曜日
週
歓迎される
上手に、うまく、よく
(goの過去形)
(we areの短縮形)
何が・を・に
(what isの短縮形)
いつ
(when isの短縮形)
どこで・に・へ
(where isの短縮形)
どちらの、どの
しばらくの間、（ある）時間
ホワイト
だれ
(who isの短縮形)
だれの
大きく
野生動物
ウイルソン（男性の名前）
勝つ
窓
冬
〜と（一緒に・ともに）
女の人、女性
(winの過去形)
すばらしい、すてきな
言葉
働く、努力する
うわあ、ああ、まあ
書く
書くこと
〜歳
はい、そうです
昨日（は）
あなた（たち）に・を
若い
あなた（たち）の
(you areの短縮形)
あなた（たち）のもの
０，ゼロ（の）
動物園
手
取っ手、柄
一生懸命に
花粉症
頭
頭痛
聞く、耳にする
重い
(he willの短縮形)
歴史
（〜を）打つ、ぶつ
穴
〜だとよいと思う
病院
温泉
ホテル
蒸し暑い
（〜を）傷つける、（〜に）けがをさせる
氷
もし〜ならば
イグアスの滝
(I willの短縮形)
大切な、重要な
インドの、インド人（の）
（〜に）影響を与える
侮辱
国際的な
（〜を）招く
かゆい
(it willの短縮形)
それの
ジム（男性の名前）
仕事
（〜に）加わる、（〜の）仲間に入る
単に、ただ〜だけ、ちょっと
ケント（男性の名前）
ケスラー（人の名前）
こども
キリマンジャロ
婦人
入国カード
言語
遅く、遅れて
後で
最新の
（〜を）学ぶ
（〜に）つながる、結びつく
出発する
脚
（〜を）貸す
(littleの比較級)、〜だけ足りない
高さ、高度
生活、暮らし
少なく
(lifeの複数形)
道に迷った
（音・声などが）大きい
運
運のよい
マケドニア（ヨーロッパの国の名前）
マチュ・ピチュ
(makeの過去形)
雑誌
男の人、男性、人、人間
マノン（女性の名前）
メアリー（女性の名前）
〜してもいい
食事
肉
メダル
薬
会議、集会、メーティング、会合
伝言
メートル
分（時間の単立）
鏡
紛失した、行方不明の
お母さん
最も
山
動く、移動する
美術館、博物館
〜しなければならない
(must notの短縮形)
神秘的な
謎
ナパポーン（人の名前）
英国国立美術館
生まれた時からの
ナスカの地上絵
〜する必要がある、〜を必要とする
〜もまた・・・（し）ない
決して〜ない、今まで（一度も）〜ない
ニュース、知らせ
ノーベル平和賞
うなずく
母語によらない
鼻
尼僧
看護師
託児所
海
離れて
会社、事務所、役所
係官、職員
かつて、一度
ワンピース（マンガのタイトル）
わずかに〜しか、ただ〜だけ
反対の
独自の
もともとは、本来は
外へ
海外へ・で、外国へ・で
パブロ（男性の名前）
（〜を）包装する
痛み
画家
手のひら
パンフレット
紙
親
パリ
一部
パーティー
（〜を）手渡す
パスポート
洋菓子店
パット（男性の名前）
パーセント（記号％で表す）
人、個人
ペルー（南米の国の名前）
ふぁーん（人の名前）
薬剤師
フィリピン（東南アジアの国の名前）
１つ、１枚
場所
飛行機
プラスチックの、ビニールの
指し示す
警察
ポロ
貧しい
人気がある
郵便、郵便物
絵はがき
なべ
ポンド
力強い、迫力のある
産物、製品
目的
（〜を）押す
（〜を）置く、向ける
質問、問題
雨が降る
雨降りの
（〜を）上げる
(runの過去形)
（〜を）リサイクルする
赤鬼
減らす
覚えている、覚えておく
ルノワール（フランスの画家）
資源、財源
休む
レストラン
帰りの
再利用する
味のこってりした、栄養価が高い
乗る
川
焼いた、あぶった
(rideの過去形)
丸い
鼻水が出る
(saidの過去形)
サバンナ
（〜を）節約する
（〜を）怖がらせる
彫刻
海
座席
部分、部門、課
（〜を）売る
意味
(sendの過去形)
（食事・飲みものを）出す
（〜を）振れる
〜しましょうか。
(she willの短縮形)
棚
シャツ
靴
店
〜すべきである
（〜と）大声で言う、叫ぶ
病気の
横
観光
似た
簡単な、容易な
歌手
場所、用地
大きさ、サイズ
雪が降る
雪の
やわらかい
解決する
何か
息子
痛い、ひりひりする
分類する,　えり分ける
スープ
話す人
(speakの過去形)
広がる
親方
スタジアム、競技場
スター・ワォーズ
ききん、飢え
駅
（〜の状態の）ままでいる
シチュー
まだ
胃、腹
腹痛
（〜を）やめる
店、
通り
強い
用件、話題
地下鉄
そんなに〜な、そのような
突然
相撲部屋
力士
晴れた、明るく日の射す
スーパーマーケット
剣
テーブル
タンザニア
(teachの過去形)
タクシー
温度、気温
テレサ（女性の名前）
タイの、タイ人の
〜よりも
タイ（国の名前）
劇場
(there areの短縮形)
(there isの短縮形)
(they willの短縮形)
(thinkの過去形)
千（の）
のど
切符、チケット
東京スカイツリー
(tellの過去形)
国語、言語
(takeの過去形)
道具
歯痛
歯ブラシ
頂上
困難な
トーナメント、勝ち抜き試合
タワー、塔
交通
旅行する
宝（物）
旅行
本当の、真実の
チューブ
イギリス
あー、えー
〜の下に・で
地下
〜まで（ずっと）
(onと同じ意味)
使用済みの、使い古した
普通は、いつもは
野菜
ベネズエラ（国の名前）
ベトナム（国の名前)
村
訪問者
声、音
（書物の）巻、冊
ウエイトレス
壁
暖かい
武士、軍人
(am, isの過去形)〜だった、〜した、〜にいた
(was notの短縮形)
滝
天気
週末
(we willの短縮形)
(areの過去形)〜だった、〜した、〜にいた
(were notの短縮形)
欧米の
（〜と）ささやく、ひそひそ声で言う
なぜ、どうして
妻
するだろう、するつもりだ
風が強い
〜なしで・に・の
(womanの複数形)
(will notの短縮形)
世界
ワールドカップ
世界遺産
心配する
(would likeの形でていねいな使います)
間違った
(writeの過去形)
（否定文で）まだ
ヨークシャー・プディング
(you willの短縮形)
あなた自身に・を
ハム
幸福
収穫、収穫物
(has notの短縮形)
(have notの短縮形)
健康
(hearの過去・過去分詞形)
暖房器具
(holdの過去・過去分詞形)
(here isの短縮形)
彼女自身
丘
休日、祝日
人間
(I wouldの短縮形)
〜を含めて
増加する、増える
工業
（変化を表して）〜に（なって、変わって）
（人を）紹介する
島
(I haveの短縮形)
記者、ジャーナリスト
ジュノー（アラスカ州の州都）
カラオケ
(keepの過去・過去分詞形)
（〜を）殺す
(knowの過去分詞形)
湖
着陸する
法、法律
指導者
ある、横たわる、〜に位置する
（電車の）線、路線
生きている
負ける
(lieの-ing形)
沼
融解する、融ける
記憶力、記憶
(manの複数形)
(meetの過去形・過去分詞形)
（〜を）見そこなう
口
国の、国民の
国民の祝日
天然ガス
必要な、なくはならない
巣
新聞
白人以外の人
麺類
〜でも・・・でもない
北へ
ノース・カロライナ（アメリカの州の名前）
（〜を）気付く
石油、油
沖縄県平和新念資料館
意見
オーケストラ
普通の
（〜の）起源、由来
私たち自身
１組、１対
パネル
麻痺する
パラタ（インドの食べもの）
過去
体育
完全な、申し分のない
完全に、申し分なく
言い回し、フレーズ、句
植える
取り皿
午後〜時
詩
汚染、公害
力
王子
問題
（〜を）つくる、つくり出す
すぐに、急いで
静かな
とても、本当に
人種
ラジオ
虹
(ringの過去形)
〜する準備できた
赤（い・の）
(CD・レコードを)発売する
（〜を）取り除く
レポート、報告
レポーター
研究、調査
（〜を）尊敬する
責任を負うべき
リズム
鳴る
ロボット
古代のローマ人、現代のローマ市民
ローマ
規則、きまり
琉球王国
サラダ
(singの過去形)
景色、風景
科学者
種
(seeの過去分詞形)
年上の、上級の
（〜を）分ける
深刻な、重大な
分かち合う
船
（〜に）ショックを与える
(should notの短縮形)
神社
（過去・過去分詞形も同じ）（〜を）閉める
〜以来、〜してから（今まで）
位置、場所、状況
技術
熟練した
ゆっくりと
〜のにおいがする
スモッグ
スニーカー
靴下
ソファー
ソフトボール
太陽の
だれか
どこかに、どこかへ、どこかで
歌
ソニア（女性の名前）
南へ
南アフリカの国の名前
南の
スペイン
スピーチ、演説
（〜を）つづる
（時を）過ごす
(speakの過去分詞形)
スプーン
スティービー・ワンダー（アメリカの歌手）
弦楽器
郊外
太陽
日光、陽光
（〜を）支える、（〜を）支持する
（〜を）囲む、取り巻く
（〜を）ごくりと飲みこむ
シンボル（マーク）、しるし
(takeの過去分詞形)
チームメイト
(they haveの短縮形)
（〜を）投げる
タイミング、時機を選ぶこと
感動させる
〜の方へ
プラットホーム
（〜を）訳す、翻訳する
輸送機関
（〜を）わなで捕まえる、閉じこめる
木
トラブル
信頼する
曲がり角、回転
二度、２倍
汚い、不潔な
一輪車
ユニフォーム
国際連合
（〜の）プラグを抜く
有益な、役に立つ
戦争
廃棄物、ゴミ
(wearの過去分詞形)
(we haveの短縮形)
クジラ
白（い・の）
（まとまった）全体の、すべての、全〜
風
希望
木材、（複数形で）森
木製の
包む
(writeの過去分詞形)
黄色（い・の）
ヨーグルト
(you haveの短縮形)
